#
# RUN COMMAND: brew bundle
# To read more: https://docs.brew.sh/Manpage#bundle-subcommand

# -----------------------------------------------------------------------------
# ----- General Cask Apps
cask "1password"
cask "alfred"
cask "keepingyouawake"
cask "choosy"
cask "cleanmymac"
# cask "discord"
cask "expressvpn"
cask "firefox"
cask "google-chrome"
cask "google-backup-and-sync"
# cask "handbrake"
  # Logitech Options - used with the MX Master 2S mouse to set button configs
cask "homebrew/cask-drivers/logitech-options"
cask "kindle"
cask "micro-snitch"
cask "microsoft-edge"
cask "notion"
cask "raindropio"
cask "signal"
cask "slack"
cask "spotify"
#Synology Assistant (for DS212j / DS416play)
cask "synologyassistant"
cask "vlc"
# -----------------------------------------------------------------------------
# ----- CLI tools
# Customise spotify UI!
brew "khanhas/tap/spicetify-cli"
# Documentation Links
# youtube-dl:  https://github.com/rg3/youtube-dl
# To download audio only in MP3 format
# youtube-dl -x --audio-format mp3 SXa8xWiFd9U
brew "youtube-dl"
# -----------------------------------------------------------------------------
# ----- Developer tools
# Note!  Atom installation is moved to within the atom role
# cask "atom"
cask "charles"
cask "dash"
cask "docker"
cask "homebrew/cask-versions/firefox-developer-edition"
cask "insomnia"
cask "iterm2"
cask "mongodb-compass"
# cask "postico"
cask "postgres"
cask "sketch"
cask "tableplus"
cask "tower"
cask "transmit"
cask "visual-studio-code"
# -----------------------------------------------------------------------------
# ----- Mac Gaming
cask "gog-galaxy"
cask "openemu"
cask "steam"
# cask "dolphin"
# Wineskin winery for running Windows games on OS X
# cask "wineskin-winery"

# -----------------------------------------------------------------------------
# Requires Manual Install:
# - Aseprite (HumbleBundle Library)
# - Tiled
#
# App Store required for:
# - Moom
# - Noizio
# - Pixelmator
# - Sip
# - The Unarchiver
#
